# Pandas - Operaciones

In [1]:
import numpy as np
import pandas as pd

In [2]:
diccionario = {"A":[11,12,10,12], "B":[14,18,16,17]}
dataframe = pd.DataFrame(diccionario,index=["i1","i2","i3","i4"])
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [3]:
#el 12 se repite

In [4]:
dataframe["A"].unique() #con el .unique solo devuelve los valores sin repeticion

array([11, 12, 10], dtype=int64)

In [7]:
dataframe["A"].nunique() #3 valores unicos

3

In [9]:
dataframe["A"].value_counts() #las veces que aparece un valor

12    2
10    1
11    1
Name: A, dtype: int64

In [10]:
def multiplicar(n):
    return n*2

In [11]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [13]:
dataframe["A"].apply(multiplicar) #aplicar una funcion a una columna

i1    22
i2    24
i3    20
i4    24
Name: A, dtype: int64

In [16]:
 dataframe["A"].apply(lambda x: x*2) #las funciones lambda son funciones que no se declaran,
                                     #sino que se pueden utilizar como parametro y hacer una función ahí

i1    22
i2    24
i3    20
i4    24
Name: A, dtype: int64

In [17]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [19]:
dataframe.drop("B",axis=1)

     A
i1  11
i2  12
i3  10
i4  12

In [20]:
dataframe.drop("i3")

     A   B
i1  11  14
i2  12  18
i4  12  17

In [21]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [22]:
dataframe.columns

Index(['A', 'B'], dtype='object')

In [23]:
dataframe.index

Index(['i1', 'i2', 'i3', 'i4'], dtype='object')

In [24]:
dataframe.sort_values("B")

     A   B
i1  11  14
i3  10  16
i4  12  17
i2  12  18